module.exports = {
  // =====================
  // NOABOP
  // =====================

  clientId:
    "1549754322131222598",

  guildId:
    "1489571427567796326",

  // =====================
  // VERIFY
  // =====================

  // הרול שמקבלים בלחיצה על Verify
  memberRoleId:
    "1551947696644821072",

  // =====================
  // STAFF
  // =====================

  staffRoleId:
    "1530262361146003456",

  // =====================
  // TAKE ROLE
  // =====================

  // תכניס כאן IDs של רולים.
  // שם הכפתור נלקח אוטומטית משם הרול בשרת.
  // עד 25 רולים.
  takeRoleIds: [
    "1552409694687993916",
    "1552409594045792346",
    "1552409828155203654"
  ],

  // =====================
  // CHAT MUTE
  // =====================

  muteRoleId:
    "1552408453031395468",

  // אופציונלי — השאר "" אם לא צריך לוגים.
  modLogsChannelId: "1533958151525630043",

  // =====================
  // TICKETS
  // =====================

  ticketCategoryId:
    "1550848648399822868",

  ticketStaffRoleId:
    "1530262361146003456",

  // הרול שרואה טיקטים של Apply For Staff.
  // אם אותו צוות מטפל בהכול, שים אותו ID כמו ticketStaffRoleId.
  staffTestTicketRoleId:
    "1547920868964040784",

  ticketLogsChannelId:
    "1530571895186133092",

  // =====================
  // WELCOME
  // =====================

  welcomeChannelId:
    "1550855485878575286",

  // אופציונלי: לינק ישיר לתמונת רקע.
  // אם נשאר "", הבוט משתמש ב־Server Banner ואם אין אז Server Icon.
  welcomeBackgroundUrl: "",

  // =====================
  // GRAPHIC PANELS
  // =====================

  // רקע ל־!h / Ticket Panel / Staff Panel.
  // אם נשאר "", הבוט משתמש ב־Server Banner ואם אין אז Server Icon.
  panelBackgroundUrl: ""
};
